In [1]:
import pandas as pd
import numpy as np

In [2]:
from io import StringIO

In [3]:
df=pd.read_csv('sample_data.csv')
df.head()

    Name  Age     City  Salary
0    Ram   25    Delhi    1000
1  Shyam   30   Mumbai    2000
2  Radha   22  Kolkata    1500
3   Sita   28  Chennai    2500
4  Gopal   26     Pune    1800

In [4]:
type(df)

pandas.core.frame.DataFrame

In [7]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3')

In [8]:
type(data)

str

In [10]:
##in memony file format object
StringIO(data)

In [11]:
pd.read_csv(StringIO(data))

  col1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [18]:
pd.read_csv(StringIO(data),usecols=[0,1])

  col1  col2
0    x     y
1    a     b
2    c     d

In [21]:
df=pd.read_csv('sample_data.csv', usecols=['Age', 'City'])
df.head()

   Age     City
0   25    Delhi
1   30   Mumbai
2   22  Kolkata
3   28  Chennai
4   26     Pune

In [23]:
df.to_csv('test.csv, index=False')

In [24]:
 ##datatype in csv
data=('a,b,c,d\n'
        '1,2,3,4\n'
         '5,6,7,8\n'
           '9,10,11')

In [25]:
pd.read_csv(StringIO(data))

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     5 non-null      int64
 1   City    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [28]:
df=pd.read_csv(StringIO(data),dtype='object')

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [35]:
df.head

<bound method NDFrame.head of    a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN>

In [32]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [33]:
df['a'][0]

'1'

In [36]:
 ##datatype in csv
data=('a,b,c,d\n'
        '1,2,3,4\n'
         '5,6,7,8\n'
           '9,10,11')

In [37]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [38]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      float64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 228.0 bytes

In [40]:
df.dtypes

a      int64
b    float64
c      int64
d    float64
dtype: object

In [41]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orange,cow,10')

In [44]:
pd.read_csv(StringIO(data), index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [83]:
#use index cols and usecols
data = ('index,a,b\n'
         '4,apple,bat\n'
         '8,orange,cow')

In [84]:
pd.read_csv(StringIO(data),  index_col=0)

            a    b
index
4       apple  bat
8      orange  cow

In [91]:
pd.read_csv(StringIO(data),usecols=['index','a','b'], index_col=0)

            a    b
index
4       apple  bat
8      orange  cow